In [29]:
import pandas as pd
data=pd.read_csv("pandas.csv")
data

   Unnamed: 0     Name  Age  Salary
0           0    Bhanu   18    1500
1           1  Sravani   17    1200
2           2     Rani   20    2200
3           3   Pavani   19    1700
4           4      Anu   16    1600
5           5    Kavya   25    3000
6           6   Monika   26    3200
7           7   Bhavya   22    1800
8           8   Manasa   30    2500

In [2]:
import pandas as pd
data=pd.read_csv("pandas.csv")
data[data["Age"]>20]

   Unnamed: 0    Name  Age  Salary
5           5   Kavya   25    3000
6           6  Monika   26    3200
7           7  Bhavya   22    1800
8           8  Manasa   30    2500

In [3]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  9 non-null      int64
 1   Name        9 non-null      object
 2   Age         9 non-null      int64
 3   Salary      9 non-null      int64
dtypes: int64(3), object(1)
memory usage: 416.0+ bytes

In [4]:
data.head(3)

   Unnamed: 0     Name  Age  Salary
0           0    Bhanu   18    1500
1           1  Sravani   17    1200
2           2     Rani   20    2200

In [5]:
data.tail(3)

   Unnamed: 0    Name  Age  Salary
6           6  Monika   26    3200
7           7  Bhavya   22    1800
8           8  Manasa   30    2500

In [9]:
data[["Age","Name"]]

   Age     Name
0   18    Bhanu
1   17  Sravani
2   20     Rani
3   19   Pavani
4   16      Anu
5   25    Kavya
6   26   Monika
7   22   Bhavya
8   30   Manasa

In [10]:
data["Age"]

0    18
1    17
2    20
3    19
4    16
5    25
6    26
7    22
8    30
Name: Age, dtype: int64

In [11]:
data["Age"].max()

30

In [12]:
data["Age"].min()

16

In [13]:
data["Name"].max()

'Sravani'

In [14]:
data["Name"].min()

'Anu'

In [15]:
data["Age"]>20

0    False
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
Name: Age, dtype: bool

In [17]:
data[data["Age"]>20]

   Unnamed: 0    Name  Age  Salary
5           5   Kavya   25    3000
6           6  Monika   26    3200
7           7  Bhavya   22    1800
8           8  Manasa   30    2500

In [19]:
data.Age.describe()

count     9.000000
mean     21.444444
std       4.693376
min      16.000000
25%      18.000000
50%      20.000000
75%      25.000000
max      30.000000
Name: Age, dtype: float64

In [20]:
data

   Unnamed: 0     Name  Age  Salary
0           0    Bhanu   18    1500
1           1  Sravani   17    1200
2           2     Rani   20    2200
3           3   Pavani   19    1700
4           4      Anu   16    1600
5           5    Kavya   25    3000
6           6   Monika   26    3200
7           7   Bhavya   22    1800
8           8   Manasa   30    2500

In [27]:
print(data.loc[6])

Unnamed: 0         6
Name          Monika
Age               26
Salary          3200
Name: 6, dtype: object

In [30]:
import pandas as pd
df=pd.read_csv("pandas.csv")
df

   Unnamed: 0     Name  Age  Salary
0           0    Bhanu   18    1500
1           1  Sravani   17    1200
2           2     Rani   20    2200
3           3   Pavani   19    1700
4           4      Anu   16    1600
5           5    Kavya   25    3000
6           6   Monika   26    3200
7           7   Bhavya   22    1800
8           8   Manasa   30    2500

In [32]:
print(df.loc[df["Age"]>20])

   Unnamed: 0    Name  Age  Salary
5           5   Kavya   25    3000
6           6  Monika   26    3200
7           7  Bhavya   22    1800
8           8  Manasa   30    2500

In [39]:
data["Adderess"]=["p","q","r","s","t","u","v","w","x"]
data

   Unnamed: 0     Name  Age  Salary Adderess
0           0    Bhanu   18    1500        p
1           1  Sravani   17    1200        q
2           2     Rani   20    2200        r
3           3   Pavani   19    1700        s
4           4      Anu   16    1600        t
5           5    Kavya   25    3000        u
6           6   Monika   26    3200        v
7           7   Bhavya   22    1800        w
8           8   Manasa   30    2500        x

In [40]:
data["Marks"]=0

In [41]:
data

   Unnamed: 0     Name  Age  Salary Adderess  Marks
0           0    Bhanu   18    1500        p      0
1           1  Sravani   17    1200        q      0
2           2     Rani   20    2200        r      0
3           3   Pavani   19    1700        s      0
4           4      Anu   16    1600        t      0
5           5    Kavya   25    3000        u      0
6           6   Monika   26    3200        v      0
7           7   Bhavya   22    1800        w      0
8           8   Manasa   30    2500        x      0

In [43]:
data.loc[1]

Unnamed: 0          1
Name          Sravani
Age                17
Salary           1200
Adderess            q
Marks               0
Name: 1, dtype: object

In [45]:
data.loc[2,"Name"]

'Rani'

In [48]:
newdata=data[(data.Age>20)&(data.Salary>100)]
newdata

   Unnamed: 0    Name  Age  Salary Adderess  Marks
5           5   Kavya   25    3000        u      0
6           6  Monika   26    3200        v      0
7           7  Bhavya   22    1800        w      0
8           8  Manasa   30    2500        x      0

In [49]:
newdata["Name"]

5     Kavya
6    Monika
7    Bhavya
8    Manasa
Name: Name, dtype: object

In [64]:
newdata["Name"]

5     Kavya
6    Monika
7    Bhavya
8    Manasa
Name: Name, dtype: object

In [8]:
data

NameError: name 'data' is not defined

In [1]:
import pandas as pd
df=pd.read_csv("data.csv")
print(df)

    month no  facecream  facewash  toothpast  bathingsoap  shampoo  \
0          1       2500      1500       5200         9200     1200
1          2       2630      1200       5100         6100     2100
2          3       2140      1340       4550         9550     3550
3          4       3400      1130       5870         8870     1870
4          5       3600      1740       4560         7760     1560
5          6       2760      1555       4890         7490     1890
6          7       2980      1120       4780         8980     1780
7          8       3700      1400       5860         9960     2860
8          9       3540      1780       6100         8100     2100
9         10       1990      1890       8300        10300     2300
10        11       2340      2100       7300        13300     2400
11        12       2900      1760       7400        14400     1800

    moisturizer  total_units  total_profit
0          1500        21100        211000
1          1200        18330        183300
2          1340        22470        224700
3          1130        22270        222700
4          1740        20960        209600
5          1555        20140        201400
6          1120        29550        295500
7          1400        36140        361400
8          1780        23400        234000
9          1890        26670        266700
10         2100        41280        412800
11         1760        30020        300200